# PathStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementPath..::..PathStyle Property
DisplacementPath Class See Also
---
Specifies the style of the path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DisplacementPathStyle PathStyle { get; set; }
```

Visual Basic
---
```text
Public Property PathStyle As DisplacementPathStyle
	Get
	Set
```

Visual C++
---
```text
public:
property DisplacementPathStyle PathStyle {
	DisplacementPathStyle get ();
	void set (DisplacementPathStyle value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace